#!/usr/bin/env python
# -*- coding: UTF-8 -*-
"""
Author： 刘逸珑
Time：   2021/12/25 11:46
"""
import json

with open("original_data.json", 'r') as File:
    json_data = json.load(File)
    print(json_data[0])
    print("\u516c\u56ed\u524d" is "公元前")
    print("\u516c\u56ed\u524d" == "公元前")



    print( "公元前" in json_data[0] )

# import chardet

# list = ['广州东站', '体育中心', '体育西路', '杨箕', '东山口', '烈士陵园', '农讲所', '公园前', '西门口', '陈家祠', '长寿路', '黄沙', '芳村', '花地湾', '坑口', '西朗', '广州南站', '石壁', '会江', '南浦', '洛溪', '南洲', '东晓南', '江泰路', '昌岗', '江南西', '市二宫', '海珠广场', '纪念堂', '越秀公园', '广州火车站', '三元里', '飞翔公园', '白云公园', '白云文化广场', '萧岗', '江夏', '黄边', '嘉禾望岗', '天河客运站', '五山', '华师', '岗顶', '石牌桥', '珠江新城', '广州塔', '客村', '大塘', '沥滘', '厦滘', '大石', '汉溪长隆', '市桥', '番禺广场', '机场北', '机场南', '高增', '人和', '龙归', '白云大道北', '永泰', '同和', '京溪南方医院', '梅花园', '燕塘', '林和西']
# print(type(list))
# chardet.detect('公园前')
# chardet.detect(list[7])


